### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.aws-read-only.aws_iam_user_policy_attachment.user-attach["arn:aws:iam::aws:policy/IAMUserChangePassword"] will be created
+   resource "aws_iam_user_policy_attachment" "user-attach" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/IAMUserChangePassword"
+       user       = "test-user"
    }

  # module.aws-read-only.aws_iam_user_policy_attachment.user-attach["arn:aws:iam::aws:policy/ReadOnlyAccess"] will be created
+   resource "aws_iam_user_policy_attachment" "user-attach" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess"
+       user       = "test-user"
    }

  # module.aws-read-only.module.iam_user.aws_iam_access_key.this[0] will be created
+   resource "aws_iam_access_key" "this" {
+       create_date                    = (known after apply)
+       encrypted_secret               = (known after apply)
+       encrypted_ses_smtp_password_v4 = (known after apply)
+       id                             = (known after apply)
+       key_fingerprint                = (known after apply)
+       pgp_key                        = "keybase:devopsmher"
+       secret                         = (sensitive value)
+       ses_smtp_password_v4           = (sensitive value)
+       status                         = "Active"
+       user                           = "test-user"
    }

  # module.aws-read-only.module.iam_user.aws_iam_user.this[0] will be created
+   resource "aws_iam_user" "this" {
+       arn           = (known after apply)
+       force_destroy = false
+       id            = (known after apply)
+       name          = "test-user"
+       path          = "/"
+       tags_all      = (known after apply)
+       unique_id     = (known after apply)
    }

  # module.aws-read-only.module.iam_user.aws_iam_user_login_profile.this[0] will be created
+   resource "aws_iam_user_login_profile" "this" {
+       encrypted_password      = (known after apply)
+       id                      = (known after apply)
+       key_fingerprint         = (known after apply)
+       password                = (known after apply)
+       password_length         = 20
+       password_reset_required = true
+       pgp_key                 = "keybase:devopsmher"
+       user                    = "test-user"
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```
</details>